package by.bemn.java_intro_online.algorithmization_02.array_one_sort;

import java.util.Scanner;

// Даны две последовательности a1 < a2 <...< an и b1 < b2 <...< bm.
// Образовать из них новую последовательность чисел так, чтобы она тоже была неубывающей.
// Примечание. Дополнительный массив не использовать.

public class Task2 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.print("Enter size of array1  N : ");
        int sizeArray_1 = scanner.nextInt();

        System.out.print("Enter size of array2  N : ");
        int sizeArray_2 = scanner.nextInt();
    }
}
